<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                   │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\General\Utilities                                                                     │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2020 - 2025 Zheta (teguhpjs@gmail.com)                                                                              │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace App\Http\Helpers\ZhtHelper\General\Utilities
    {
    /*
    ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
    │ ▪ Class Name  │ Helper_DateTime                                                                                              │
    │ ▪ Description │ Menangani segala hal yang terkait Tanggal dan Waktu                                                          │
    └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
    */
    class Helper_DateTime
        {
        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __construct                                                                                          │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2025-12-11                                                                                           │
        │ ▪ Creation Date   │ 2025-12-11                                                                                           │
        │ ▪ Description     │ System's Default Constructor                                                                         │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __construct()
            {
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __destruct                                                                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2025-12-11                                                                                           │
        │ ▪ Creation Date   │ 2025-12-11                                                                                           │
        │ ▪ Description     │ System's Default Destructor                                                                          │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __destruct()
            {
            }
        

        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getTimeStampTZConvert_PHPDateTimeToDateTimeTZString                                                  │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000001                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2025-09-12                                                                                           │
        │ ▪ Description     │ Mengkonversi PHP Date Time ke Date Time String With Timezone                                         │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession ► User Session                                                                            │
        │      ▪ (\DateTime) varPHPDateTime ► PHP DateTime                                                                         │
        │      ------------------------------                                                                                      │
        │      ▪ (int)    varTimeZoneOffset ► Time Zone Offset                                                                     │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public static function getTimeStampTZConvert_PHPDateTimeToDateTimeTZString(
            $varUserSession, \DateTime $varPHPDateTime,
            int $varTimeZoneOffset = null
            )
            {
            //---> Data Initialization
                $varReturn = null;

            //---> Data Process
                try {
                    if ($varTimeZoneOffset === null) {
                        $varTimeZoneOffset =
                            self::getTimeZoneOffset (
                                $varUserSession
                                );

                        $varReturn = (
                            $varPHPDateTime->format ('Y-m-d H:i:s.u').
                            ((((int) explode (':', $varTimeZoneOffset)[0]) * 1) >= 0 ? '+' : '-').
                            $varTimeZoneOffset
                            );
                        }
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getTimeZoneOffset                                                                                    │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000001                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2025-09-22                                                                                           │
        │ ▪ Description     │ Mendapatkan Time Zone Offset dari suatu Zone (varZone)                                               │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession ► User Session                                                                            │
        │      ------------------------------                                                                                      │
        │      ▪ (string) varZone ► Zone                                                                                           │
        │ ▪ Output Variable :                                                                                                      │
        |      ▪ (int)    varReturn                                                                                                |
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public static function getTimeZoneOffset (
            $varUserSession,
            string $varZone = null
            )
            {
            if (!$varZone)
                {
                $varZone =
                    'Asia/Jakarta';
                }
            else
                {
                try {
                    $varTemp =
                        explode (
                            ':',
                            $varZone
                            );

                    $varReturn = (
                        str_pad($varTemp[0], 2, '0', STR_PAD_LEFT).
                        ':'.
                        str_pad($varTemp[1], 2, '0', STR_PAD_LEFT)
                        );
                    } 

                catch (\Exception $ex) {
                    try {
                        $varReturn = (
                            str_pad (
                                ((int) ($varTemp[0]) * 1),
                                2,
                                '0',
                                STR_PAD_LEFT
                                ).
                            ':'.
                            '00'
                            );                                    
                        }

                    catch (\Exception $ex) {
                        $varReturn = null;
                        }
                    }
                }

            if ($varReturn == null) {
                 $varLocalDateTimeZone =
                     new \DateTimeZone (
                        $varZone
                        );

                 $varDateTimeLocal =
                     new \DateTime (
                        "now",
                        $varLocalDateTimeZone
                        );

                 $varRemainInSeconds =
                     ($varLocalDateTimeZone->getOffset($varDateTimeLocal));

                 //$varRemainInSeconds += (30 * 60);

                 $varHoursTimeOffset = 
                     (int) ($varRemainInSeconds / (60*60));

                 $varRemainInSeconds = 
                     $varRemainInSeconds - ($varHoursTimeOffset * (60 * 60));

                 $varMinutesTimeOffset = 
                     (int) ($varRemainInSeconds / 60);

                 $varRemainInSeconds = 
                     $varRemainInSeconds - ($varMinutesTimeOffset * (60));

                 $varReturn = (
                     str_pad ($varHoursTimeOffset, 2, '0', STR_PAD_LEFT).
                     ':'.
                     str_pad ($varMinutesTimeOffset, 2, '0', STR_PAD_LEFT)
                     );
                 }
            }
        }
    }