<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                           │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\General\Utilities                                                                             │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2025 Zheta (teguhpjs@gmail.com)                                                                                             │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Http\Helpers\ZhtHelper\General\Utilities
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ Helper_EncodeDecode                                                                                              │
        │ ▪ Description │ Menangani segala hal yang terkait Encode dan Decode Data                                                         │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            Helper_EncodeDecode
                {
                /*
                ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ Class Property Declaration                                                                                               │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __construct                                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-11                                                                                           │
                │ ▪ Creation Date   │ 2025-12-11                                                                                           │
                │ ▪ Description     │ System's Default Constructor                                                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __construct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __destruct                                                                                           │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-11                                                                                           │
                │ ▪ Creation Date   │ 2025-12-11                                                                                           │
                │ ▪ Description     │ System's Default Destructor                                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __destruct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBase64Decode                                                                                      │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-26                                                                                           │
                │ ▪ Description     │ Mendapatkan decode Base64 dari data terdecode (varEncodedData)                                       │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪  varUserSession (mixed - Mandatory) ► User Session                                                                │
                │      ▪ varEncodedData (string - Mandatory) ► Data yang akan didecode ke Plain Data                                       │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getBase64Decode (
                        mixed $varUserSession, string $varEncodedData
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (string) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        base64_decode (
                                            $varEncodedData
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBase64Encode                                                                                      │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-26                                                                                           │
                │ ▪ Description     │ Mendapatkan encode Base64 dari data (varPlainData)                                                   │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varPlainData (string - Mandatory) ► Data yang akan diencode                                                       │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */  
                public static function
                    getBase64Encode (
                        mixed $varUserSession, string $varPlainData
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (string) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        base64_encode (
                                            $varPlainData
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBase64DecodeWithoutSlashCharacter                                                                 │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-26                                                                                           │
                │ ▪ Description     │ Mendapatkan decode Base64 tanpa karakter slash ('/' dikonversi menjadi '-' atau pada karakter lain   │
                │                   │ (varReplacementCharacter)) dari data terencode (varEncodedData)                                      │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varEncodedData (string - Mandatory) ► Data yang akan didecode                                                     │
                │      ------------------------------                                                                                      │
                │      ▪ varReplacementCharacter (string- Optional) ► Karakter pengganti slash ('/')                                       │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_EncodeDecode::                                               │
                │           getBase64Decode                                                                                                │
                │              ($varUserSession, string $varEncodedData)                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */     
                public static function
                    getBase64DecodeWithoutSlashCharacter (
                        mixed $varUserSession, string $varEncodedData,
                        string $varReplacementCharacter = null
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (string) null;

                                if (!$varReplacementCharacter) {
                                    $varReplacementCharacter = '-';
                                    }

                            //---> Data Process
                                try {
                                    $varReturn =
                                        self::getBase64Decode (
                                            $varUserSession,
                                            str_replace (
                                                $varReplacementCharacter,
                                                '/',
                                                $varEncodedData
                                                )
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;            
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBase64EncodeWithoutSlashCharacter                                                                 │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-26                                                                                           │
                │ ▪ Description     │ Mendapatkan encode Base64 tanpa karakter slash ('/' dikonversi menjadi '-' atau pada karakter lain   │
                │                   │ (varReplacementCharacter)) dari data (varPlainData)                                                  │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varPlainData (string - Mandatory) ► Data yang akan diencode                                                       │
                │      ------------------------------                                                                                      │
                │      ▪ varReplacementCharacter (string - Optional) ► Karakter pengganti slash ('/')                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_EncodeDecode::                                               │
                │           getBase64Encode                                                                                                │
                │              ($varUserSession, string $varPlainData)                                                                     │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */  
                public static function
                    getBase64EncodeWithoutSlashCharacter (
                        mixed $varUserSession, string $varPlainData,
                        string $varReplacementCharacter = null
                        )
                            {
                            //---> Data Initialization
                                $varReturn = null;

                                if (!$varReplacementCharacter) {
                                    $varReplacementCharacter = '-';
                                    }

                            //---> Data Process
                                try {
                                    $varReturn =
                                        str_replace (
                                            '/',
                                            $varReplacementCharacter,
                                            self::getBase64Encode (
                                                $varUserSession,
                                                $varPlainData
                                                )
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBase64URLEncode                                                                                   │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-28                                                                                           │
                │ ▪ Description     │ Mendapatkan encode Base64 URL dari data (varPlainData)                                               │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varPlainData (string - Mandatory) ► Data yang akan diencode                                                       │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_EncodeDecode::                                               │
                │           getBase64Encode                                                                                                │
                │              ($varUserSession, string $varPlainData)                                                                     │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */  
                public static function getBase64URLEncode (
                    mixed $varUserSession, string $varPlainData
                    )
                    {
                    //---> Data Initialization
                        $varReturn = null;

                    //---> Data Process
                        try {
                            $varReturn =
                                str_replace (
                                    ['+', '/', '='],
                                    ['-', '_', ''],
                                    self::getBase64Encode (
                                        $varUserSession,
                                        $varPlainData
                                        )
                                    );
                            }

                        catch (\Exception $ex) {
                            }

                    //---> Data Return
                        return
                            $varReturn;
                    }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getHTMLEncode                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2021-07-01                                                                                           │
                │ ▪ Description     │ Mendapatkan encode HTML dari data array (varDataArray)                                               │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varDataArray (string - Mandatory) ► Data yang akan diencode                                                       │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪  varReturn (array)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getHTMLEncode (
                        mixed $varUserSession, array $varDataArray
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (array) null;

                            //---> Data Process
                                try {
                                    for ($i = 0; $i != count ($varDataArray); $i++)
                                        {
                                        foreach ($varDataArray[$i] as $varKey => $varValue)
                                            {
                                            $varDataArray[$i][$varKey] =
                                                htmlspecialchars($varValue);
                                            }
                                        }

                                    $varReturn =
                                        $varDataArray;
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getJSONDecode                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2021-07-01                                                                                           │
                │ ▪ Description     │ Mendapatkan decode JSON dari data terdecode (varEncodedData)                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varEncodedData (string - Mandatory) ► Data yang akan didecode                                                     │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (array)                                                                                                 │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getJSONDecode (
                        mixed $varUserSession, string $varEncodedData
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (array) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        json_decode (
                                            $varEncodedData,
                                            true,
                                            JSON_UNESCAPED_UNICODE
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getJSONEncode                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000002                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2021-07-01                                                                                           │
                │ ▪ Description     │ Mendapatkan encode JSON dari data (varPlainData)                                                     │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varPlainData (array - Mandatory) ► Data yang akan diencode                                                        │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */  
                public static function
                    getJSONEncode (
                        mixed $varUserSession, array $varPlainData
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (string) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        json_encode (
                                            $varPlainData,
                                            true
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getUTF8Encode                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-15                                                                                           │
                │ ▪ Creation Date   │ 2020-07-28                                                                                           │
                │ ▪ Description     │ Mendapatkan encode UTF8 dari data (varData)                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varPlainData (string - Mandatory) ► Data yang akan diencode                                                       │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */            
                public static function
                    getUTF8Encode (
                        mixed $varUserSession, string $varPlainData
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (string) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        utf8_encode (
                                            $varPlainData
                                            );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }
                }
        }