<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                           │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\General\Utilities                                                                             │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2025 Zheta (teguhpjs@gmail.com)                                                                                             │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Http\Helpers\ZhtHelper\General\Utilities
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ Helper_PHPObject                                                                                                 │
        │ ▪ Description │ Menangani segala hal yang terkait Objek PHP                                                                      │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            Helper_PHPObject
                {
                /*
                ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ Class Property Declaration                                                                                               │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __construct                                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-18                                                                                           │
                │ ▪ Creation Date   │ 2025-12-18                                                                                           │
                │ ▪ Description     │ System's Default Constructor                                                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __construct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __destruct                                                                                           │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-18                                                                                           │
                │ ▪ Creation Date   │ 2025-12-18                                                                                           │
                │ ▪ Description     │ System's Default Destructor                                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __destruct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getAllFunctionInPHPFile                                                                              │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-18                                                                                           │
                │ ▪ Creation Date   │ 2025-12-18                                                                                           │
                │ ▪ Description     │ Mendapatkan Seluruh Function dari suatu File PHP                                                     │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varFilePath (string - Mandatory) ► File Path                                                                      │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (array)                                                                                                 │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getAllFunctionInPHPFile (
                        mixed $varUserSession, string $varFilePath
                        )
                            {
                            //---> Data Initialization
                                $varReturn = (array) null;

                            //---> Data Process
                                try {
                                    $varSource =
                                        file_get_contents (
                                            $varFilePath
                                            );

                                    $varPattern =
                                        '/'.
                                        '(((public)|(protected)|(public))?)+([\s])*+(static)?+([\s])*+(function)+([\s]*)+([a-zA-Z0-9_-]*)+([\s]*)+(\()+([\s]*)+([a-zA-Z0-9_=&$,\s\\\\]*)+([\s]*)+(\))'.
                                        '/m';

                                    preg_match_all (
                                        $varPattern,
                                        $varSource,
                                        $varArrayMatches
                                        );

                                    $varArrayData = $varArrayMatches[0];
                                    
                                    for ($i = 0, $iMax = count ($varArrayMatches[0]); $i != $iMax; $i++)
                                        {
                                        $varTemp =
                                            explode (
                                                'function',
                                                $varArrayMatches[0][$i]
                                                );
                                        $varTemp2 =
                                            explode (
                                                '(',
                                                $varTemp[1]
                                                );
                                        
                                        $varReturn[$i] = [
                                            'Scope' =>
                                                rtrim (
                                                    ltrim (
                                                        $varTemp[0]
                                                        )
                                                    ),
                                            'Name' =>
                                                preg_replace (
                                                    '/\s+/',
                                                    '',
                                                    $varTemp2[0]
                                                    ),
                                            'Parameters' =>
                                                rtrim (
                                                    ltrim (
                                                        str_replace (
                                                            ')',
                                                            '',
                                                            $varTemp2[1]
                                                            )
                                                        )
                                                    )
                                            ];

                                        $varReturn[$i]['FullFunction'] = (
                                            $varReturn[$i]['Scope'].
                                            ((strcmp($varReturn[$i]['Scope'], '') == 0) ? '' : ' ').
                                            'function '.
                                            $varReturn[$i]['Name'].
                                            ' '.
                                            ('('.$varReturn[$i]['Parameters'].')')
                                            );
                                        }
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getClassNameFromNameSpace                                                                            │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-08-31                                                                                           │
                │ ▪ Description     │ Mendapatkan Class Name dari Full Name Space                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varNameSpace (string - Mandatory) ► Name Space                                                                    │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getClassNameFromNameSpace (
                        mixed $varUserSession, string $varNameSpace
                        )
                            {
                            //---> Data Initialization
                                $varReturn = (string) null;

                            //---> Data Process
                                try {
                                    $varTemp =
                                        explode (
                                            '\\',
                                            $varNameSpace
                                            );

                                    $varReturn = (
                                        $varTemp[count($varTemp) - 1]
                                        );
                                    }

                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }
                }
        }