<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                   │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\BackEnd\Database                                                                      │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2020 - 2025 Zheta (teguhpjs@gmail.com)                                                                              │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace App\Http\Helpers\ZhtHelper\BackEnd\Database
    {
    /*
    ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
    │ ▪ Class Name  │ Helper_PostgreSQL                                                                                            │
    │ ▪ Description │ Menangani segala hal yang terkait Database PostgreSQL                                                        │
    └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
    */
    class Helper_PostgreSQL
        {
        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __construct                                                                                          │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2020-07-17                                                                                           │
        │ ▪ Creation Date   │ 2020-07-17                                                                                           │
        │ ▪ Description     │ System's Default Constructor                                                                         │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __construct()
            {
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __destruct                                                                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2020-07-17                                                                                           │
        │ ▪ Creation Date   │ 2020-07-17                                                                                           │
        │ ▪ Description     │ System's Default Destructor                                                                          │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __destruct()
            {
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getArrayFromQueryExecutionDataFetch_UsingLaravelConnection                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000002                                                                                       │
        │ ▪ Last Update     │ 2023-05-03                                                                                           │
        │ ▪ Creation Date   │ 2023-05-03                                                                                           │
        │ ▪ Description     │ Mengambil data berbentuk Array dari database sesuai syntax query (varSQLQuery) melalui koneksi       │
        │                   │ Laravel Connection                                                                                   │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) $varDataFetch                                                                                             │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        private static function getArrayFromQueryExecutionDataFetch_UsingLaravelConnection (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    $i = 0;

                    $varDataFetch =
                        self::getQueryExecutionDataFetch (
                            $varUserSession,
                            $varSQLQuery
                            );

                    $varData = [];
                    $varNotice = null;
                    foreach ($varDataFetch as $row)
                        {
                        $varData[] = (array) $row;
                        $i++;
                        }

                    $varReturn['data'] = $varData;
                    $varReturn['Notice'] = null;
                    $varReturn['rowCount']=$i;

                    unset ($varData);
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getArrayFromQueryExecutionDataFetch_UsingPGSQLConnection                                             │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000004                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2023-05-03                                                                                           │
        │ ▪ Description     │ Mengambil data berbentuk Array dari database sesuai syntax query (varSQLQuery) melalui koneksi       │
        │                   │ PgSql\Connection                                                                                     │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) $varDataFetch                                                                                             │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪ \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::                                                  │
        │           getArrayFromQueryExecutionDataFetch_UsingLaravelConnection                                                     │
        │              ($varUserSession, $varSQLQuery)                                                                             │
        │      ▪ \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::                                                  │
        │           getBooleanConvertion                                                                                           │
        │              ($varUserSession, $varData)                                                                                 │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        private static function getArrayFromQueryExecutionDataFetch_UsingPGSQLConnection (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    $varConfig =
                        (array) (\Illuminate\Support\Facades\DB::getConfig());
                    
                    if (!is_null ($varConfig))
                        {
                        $varConnectionString = 
                            'host='.$varConfig['host'].' '.
                            'port='.$varConfig['port'].' '.
                            'dbname='.$varConfig['database'].' '.
                            'user='.$varConfig['username'].' '.
                            'password='.$varConfig['password'];
                        //var_dump($varConnectionString);
                        
                        $i=0;
                        $varData = [];
                        $varNotice = null;
                        if ($DBConnection = pg_connect ($varConnectionString))
                            {
                            pg_last_notice (
                                $DBConnection,
                                PGSQL_NOTICE_CLEAR
                                );

                            $varResult =
                                pg_query (
                                    $DBConnection,
                                    $varSQLQuery
                                    );

                            $varNotice =
                                pg_last_notice (
                                    $DBConnection,
                                    PGSQL_NOTICE_ALL
                                    );

                            //---> Field Type Initializing
                            unset ($varFieldType);

                            for ($j=0, $jMax = pg_num_fields ($varResult); $j!=$jMax; $j++)
                                {
                                $varFieldType[$j] =
                                    pg_field_type (
                                        $varResult,
                                        $j
                                        );
                                }

                            while ($row = pg_fetch_assoc ($varResult)) {
                                $varDataContent = null;
                                $varData[$i] = $row;
                                $j = 0;
                                foreach ($varData[$i] as $key => $value)
                                    {
                                    $varData[$i][$key] = $value;
//                                    echo "<br><br><br>";
//                                    var_dump($key);
//                                    var_dump($value);

                                    $varData[$i][$key] = null;
                                    switch ($varFieldType[$j++])
                                        {
                                        case 'bool':
                                            $varData[$i][$key] =
                                                self::getBooleanConvertion (
                                                    $varUserSession,
                                                    $value
                                                    );
                                            break;
                                        case 'int2':
                                        case 'int4':
                                        case 'int8':
                                            if (!is_null($value))
                                                {
                                                $varData[$i][$key] = (int) $value;
                                                }
                                            break;
                                        case 'float4':
                                        case 'float8':
                                            if (!is_null($value))
                                                {
                                                $varData[$i][$key] = (float) $value;
                                                }
                                            break;
                                        case 'varchar':
                                        default:
                                            if (!is_null($value))
                                                {
                                                $varData[$i][$key] = $value;
                                                }
                                            break;
                                        }
                                    }
                                $i++;
                                }

                            pg_close (
                                $DBConnection
                                );
                            }

                        $varReturn['data'] = $varData;
                        $varReturn['notice'] = $varNotice;
                        $varReturn['rowCount']=$i;
                        }
                    else
                        {
                        $varDataTemp =
                            self::getArrayFromQueryExecutionDataFetch_UsingLaravelConnection (
                                $varUserSession,
                                $varSQLQuery
                                );

                        $varReturn['data'] = $varDataTemp['data'];
                        $varReturn['notice'] = $varDataTemp['notice'];
                        $varReturn['rowCount'] = $varDataTemp['rowCount'];                        
                        }
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getBooleanConvertion                                                                                 │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000001                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2023-05-03                                                                                           │
        │ ▪ Description     │ Mendapatkan konversi Boolean PHP dari data Boolean PostgreSQL (varData)                              │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (bool)   varReturn                                                                                                │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public static function getBooleanConvertion($varUserSession, $varData)
            {
            //---> Data Initialization
                $varReturn = true;

            //---> Data Process
                try {
                    if ((strcmp ($varData, 'f') == 0) OR ((boolean) $varData == false))
                        {
                        $varReturn = false;
                        }
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getQueryExecution                                                                                    │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000004                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2020-10-19                                                                                           │
        │ ▪ Description     │ Mendapatkan data dari database sesuai syntax query (varSQLQuery)                                     │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) varReturn                                                                                                 │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪ \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::                                                  │
        │           getArrayFromQueryExecutionDataFetch_UsingPGSQLConnection                                                       │
        │              ($varUserSession, $varSQLQuery)                                                                             │
        │      ▪ \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::                                                  │
        │           getResourceAvailabilityStatus                                                                                  │
        │              ($varUserSession)                                                                                           │
        │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::                                                   │
        │           getDifferenceOfDateTimeTZString                                                                                │
        │              ($varUserSession, $varSQLQuery, $varFinishDateTimeTZ)                                                       │
        │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::                                                   │
        │           getTimeStampTZConvert_PHPDateTimeToDateTimeTZString                                                            │
        │              ($varUserSession, $varPHPDateTime, $varTimeZoneOffset)                                                      │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public static function getQueryExecution (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    if (self::getResourceAvailabilityStatus ($varUserSession) === false)
                        {
                        throw
                            new \Exception('Database Resource is not available');                
                        }

                    if (!$varSQLQuery)
                        {
                        throw
                            new \Exception('Incorrect SQL syntax');
                        }
                    else
                        {
                        $varSQLQuery =
                            ltrim (
                                str_replace (
                                    "\n",
                                    ""
                                    ,
                                    $varSQLQuery
                                    )
                            );
                        //echo $varSQLQuery;

                        $varReturn['process']['DBMS']['executionTime']['interval'] = NULL;

                        //---> Inisialisasi [Process][StartDateTime]
                            $varDataTemp = 
                                self::getArrayFromQueryExecutionDataFetch_UsingLaravelConnection(
                                    $varUserSession, 
                                    "SELECT NOW();"
                                    );
                            $varTempExplode = explode('+', $varDataTemp['data'][0]['now']);
                            unset($varDataTemp);

                            $varReturn['process']['DBMS']['executionTime']['startDateTimeTZ'] =
                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::getTimeStampTZConvert_PHPDateTimeToDateTimeTZString(
                                    //\App\Helpers\ZhtHelper\System\Helper_Environment::getUserSessionID_System(),
                                    $varUserSession,
                                    (new \DateTime())
                                    );

                        //---> Inisialisasi [Data], [RowCount], [Notice]
                            //$varDataTemp = self::getArrayFromQueryExecutionDataFetch_UsingLaravelConnection($varUserSession, $varSQLQuery);
                            $varDataTemp = 
                                self::getArrayFromQueryExecutionDataFetch_UsingPGSQLConnection(
                                    $varUserSession,
                                    $varSQLQuery
                                    );

                            $varReturn['data'] = $varDataTemp['data'];
                            $varReturn['rowCount'] = $varDataTemp['rowCount'];
                            $varReturn['notice'] = $varDataTemp['notice'];

                            unset($varDataTemp);

                        //---> Inisialisasi : varReturn[process][DBMS][finishDateTimeTZ]
                            $varReturn['process']['DBMS']['executionTime']['finishDateTimeTZ'] =
                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::getTimeStampTZConvert_PHPDateTimeToDateTimeTZString(
                                    //\App\Helpers\ZhtHelper\System\Helper_Environment::getUserSessionID_System(),
                                    $varUserSession,
                                    (new \DateTime())
                                    );

                        //---> Inisialisasi : varReturn[process][DBMS][executionInterval]
                            $varReturn['process']['DBMS']['executionTime']['interval'] = 
                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::getDifferenceOfDateTimeTZString (
                                    $varUserSession,
                                    $varReturn['process']['DBMS']['executionTime']['startDateTimeTZ'],
                                    $varReturn['process']['DBMS']['executionTime']['finishDateTimeTZ']
                                    );
                        }
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }                    


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getQueryExecutionDataFetch                                                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000003                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2020-07-21                                                                                           │
        │ ▪ Description     │ Mengambil data dari database sesuai syntax query (varSQLQuery                                        │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) $varDataFetch                                                                                             │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        private static function getQueryExecutionDataFetch (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    $varSQLQuery =
                        ltrim (
                            str_replace (
                                "\n",
                                "" ,
                                $varSQLQuery
                                )
                            );

                    $varReturn =
                        \Illuminate\Support\Facades\DB::select (
                            $varSQLQuery
                            );
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Method Name     : getResourceAvailabilityStatus                                                                        |
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Version         : 1.0000.0000003                                                                                       |
        | ▪ Last Update     : 2025-12-16                                                                                           |
        | ▪ Creation Date   : 2020-07-26                                                                                           |
        | ▪ Description     : Mendapatkan status ketersediaan resource PostgreSQL                                                  |
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Input Variable  :                                                                                                      |
        |      ▪ (mixed)  varUserSession ► User Session                                                                            |
        | ▪ Output Variable :                                                                                                      |
        |      ▪ (boolean) varReturn                                                                                               |
        +--------------------------------------------------------------------------------------------------------------------------+
        */
        public static function getResourceAvailabilityStatus (
            $varUserSession
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    if (!$varDataFetch =
                        \Illuminate\Support\Facades\DB::select (
                            'SELECT 1;'
                            )
                        )
                        {
                        throw
                            new \Exception("Error");
                        }

                    $varReturn = true;
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }




        }
    }