<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                   │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\BackEnd\Database                                                                      │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2020 - 2025 Zheta (teguhpjs@gmail.com)                                                                              │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace App\Http\Helpers\ZhtHelper\BackEnd\Database
    {
    /*
    ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
    │ ▪ Class Name  │ Helper_PostgreSQL                                                                                            │
    │ ▪ Description │ Menangani segala hal yang terkait Database PostgreSQL                                                        │
    └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
    */
    class Helper_PostgreSQL
        {
        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __construct                                                                                          │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2020-07-17                                                                                           │
        │ ▪ Creation Date   │ 2020-07-17                                                                                           │
        │ ▪ Description     │ System's Default Constructor                                                                         │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __construct()
            {
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ __destruct                                                                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000000                                                                                       │
        │ ▪ Last Update     │ 2020-07-17                                                                                           │
        │ ▪ Creation Date   │ 2020-07-17                                                                                           │
        │ ▪ Description     │ System's Default Destructor                                                                          │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (void)                                                                                                            │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public function __destruct()
            {
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getArrayFromQueryExecutionDataFetch_UsingLaravelConnection                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000002                                                                                       │
        │ ▪ Last Update     │ 2023-05-03                                                                                           │
        │ ▪ Creation Date   │ 2023-05-03                                                                                           │
        │ ▪ Description     │ Mengambil data berbentuk Array dari database sesuai syntax query (varSQLQuery) melalui koneksi       │
        │                   │ Laravel Connection                                                                                   │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) $varDataFetch                                                                                             │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        private static function getArrayFromQueryExecutionDataFetch_UsingLaravelConnection (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    $i = 0;

                    $varDataFetch =
                        self::getQueryExecutionDataFetch (
                            $varUserSession,
                            $varSQLQuery
                            );

                    $varData = [];
                    $varNotice = null;
                    foreach($varDataFetch as $row)
                        {
                        $varData[] = (array) $row;
                        $i++;
                        }

                    $varReturn['data'] = $varData;
                    $varReturn['Notice'] = null;
                    $varReturn['rowCount']=$i;

                    unset($varData);
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getQueryExecution                                                                                    │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000004                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2020-10-19                                                                                           │
        │ ▪ Description     │ Mendapatkan data dari database sesuai syntax query (varSQLQuery)                                     │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) varReturn                                                                                                 │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        public static function getQueryExecution (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    if (self::getResourceAvailabilityStatus ($varUserSession) === false)
                        {
                        throw
                            new \Exception('Database Resource is not available');                
                        }

                    if (!$varSQLQuery)
                        {
                        throw
                            new \Exception('Incorrect SQL syntax');
                        }
                    else
                        {
                        $varSQLQuery =
                            ltrim (
                                str_replace (
                                    "\n",
                                    ""
                                    ,
                                    $varSQLQuery
                                    )
                            );
                        //echo $varSQLQuery;

                        $varReturn['process']['DBMS']['executionTime']['interval'] = NULL;

                        //---> Inisialisasi [Process][StartDateTime]
                            $varDataTemp = 
                                self::getArrayFromQueryExecutionDataFetch_UsingLaravelConnection(
                                    $varUserSession, 
                                    "SELECT NOW();"
                                    );
                            $varTempExplode = explode('+', $varDataTemp['data'][0]['now']);
                            unset($varDataTemp);

                            $varReturn['process']['DBMS']['executionTime']['startDateTimeTZ'] =
                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_DateTime::getTimeStampTZConvert_PHPDateTimeToDateTimeTZString(
                                    \App\Helpers\ZhtHelper\System\Helper_Environment::getUserSessionID_System(),
                                    (new \DateTime())
                                    );

                                
                        dd($varDataTemp);
                        }
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }                    


        /*
        ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Method Name     │ getQueryExecutionDataFetch                                                                           │
        ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Version         │ 1.0000.0000003                                                                                       │
        │ ▪ Last Update     │ 2025-12-16                                                                                           │
        │ ▪ Creation Date   │ 2020-07-21                                                                                           │
        │ ▪ Description     │ Mengambil data dari database sesuai syntax query (varSQLQuery                                        │
        ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Input Variable  :                                                                                                      │
        │      ▪ (mixed)  varUserSession                                                                                           │
        │      ▪ (string) varSQLQuery                                                                                              │
        │      ------------------------------                                                                                      │
        │ ▪ Output Variable :                                                                                                      │
        │      ▪ (array) $varDataFetch                                                                                             │
        ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
        │ ▪ Linked Function :                                                                                                      │
        │      ▪                                                                                                                   │
        └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        private static function getQueryExecutionDataFetch (
            $varUserSession, string $varSQLQuery
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    $varSQLQuery =
                        ltrim (
                            str_replace (
                                "\n",
                                "" ,
                                $varSQLQuery
                                )
                            );

                    $varReturn =
                        \Illuminate\Support\Facades\DB::select (
                            $varSQLQuery
                            );
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }


        /*
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Method Name     : getResourceAvailabilityStatus                                                                        |
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Version         : 1.0000.0000003                                                                                       |
        | ▪ Last Update     : 2025-12-16                                                                                           |
        | ▪ Creation Date   : 2020-07-26                                                                                           |
        | ▪ Description     : Mendapatkan status ketersediaan resource PostgreSQL                                                  |
        +--------------------------------------------------------------------------------------------------------------------------+
        | ▪ Input Variable  :                                                                                                      |
        |      ▪ (mixed)  varUserSession ► User Session                                                                            |
        | ▪ Output Variable :                                                                                                      |
        |      ▪ (boolean) varReturn                                                                                               |
        +--------------------------------------------------------------------------------------------------------------------------+
        */
        public static function getResourceAvailabilityStatus (
            $varUserSession
            )
            {
            //---> Data Initialization
                $varReturn = false;

            //---> Data Process
                try {
                    if (!$varDataFetch =
                        \Illuminate\Support\Facades\DB::select (
                            'SELECT 1;'
                            )
                        )
                        {
                        throw
                            new \Exception("Error");
                        }

                    $varReturn = true;
                    }

                catch (\Exception $ex) {
                    }

            //---> Data Return
                return
                    $varReturn;
            }




        }
    }