<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Route Controller                                                                                                          │
│ ▪ Name Space : \App\Http\Controllers\Application\BackEnd\RouteGateway\Engines\getGeneralRoute\v1                                         │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2025 Zheta (teguhpjs@gmail.com)                                                                                             │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Http\Controllers\Application\BackEnd\RouteGateway\Engines\getGeneralRoute\v1
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ getGeneralRoute                                                                                                  │
        │ ▪ Description │ Menangani Route General Version 1                                                                                │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            getGeneralRoute extends \App\Http\Controllers\Controller
                {
                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ main                                                                                                 │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-17                                                                                           │
                │ ▪ Creation Date   │ 2025-12-17                                                                                           │
                │ ▪ Description     │ Fungsi Utama Engine                                                                                  │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (mixed)  varUserSession ► User Session                                                                            │
                |      ▪ (array)  varData ► Data                                                                                           |
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (string) varReturn                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    main (
                        //$varUserSession, $varData
                        )
                            {
                            $varUserSession = 111;
                            $varReturn = [
                                'xxx' => 123
                                ];
                            return
                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_EncodeDecode::getJSONEncode (
                                    $varUserSession,
                                    $varReturn
                                    );
                            //echo "xxx";
                            }
                }
        }