<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category    : Laravel Models                                                                                                           │
│ ▪ Name Space  : \App\Models\Database\PostgreSQL                                                                                          │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2025 Zheta (teguhpjs@gmail.com)                                                                                             │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Models\Database\PostgreSQL
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ DefaultClassPrototype                                                                                            │
        │ ▪ Description │ Menangani Prototype untuk diwariskan ke Class Models Database PostgreSQL                                         │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            DefaultClassPrototype  //extends \Illuminate\Database\Eloquent\Model
                {
                /*
                ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ Class Property Declaration                                                                                               │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                private
                    $varSchemaTableName;


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __construct                                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-20                                                                                           │
                │ ▪ Creation Date   │ 2025-12-20                                                                                           │
                │ ▪ Description     │ System's Default Constructor                                                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __construct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __destruct                                                                                           │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-20                                                                                           │
                │ ▪ Creation Date   │ 2025-12-20                                                                                           │
                │ ▪ Description     │ System's Default Destructor                                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __destruct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getSchemaName                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-22                                                                                           │
                │ ▪ Creation Date   │ 2020-09-02                                                                                           │
                │ ▪ Description     │ Mendapatkan Nama Skema                                                                               │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Models\Database\PostgreSQL\SchSysConfig\General() ->                                                         │
                │           setDataDelete                                                                                                  │
                │              (mixed $varUserSession, int $varRecordID)                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    getSchemaName (
                        mixed $varUserSession
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (bool) null;

                            //---> Data Process
                                try {
                                    
                                    }
                                catch (\Exception $ex)
                                    {
                                    $varReturn =
                                        str_replace (
                                            '"',
                                            '',
                                            (
                                            explode (
                                                '.',
                                                $this->varSchemaTableName
                                                )
                                            )[0]
                                            );
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ setDataDelete                                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0001.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-20                                                                                           │
                │ ▪ Creation Date   │ 2020-11-10                                                                                           │
                │ ▪ Description     │ Menetapkan Penghapusan Record                                                                        │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varRecordID (int - Mandatory) ► Record ID                                                                         │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (bool)                                                                                                  │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Models\Database\PostgreSQL\SchSysConfig\General() ->                                                         │
                │           setDataDelete                                                                                                  │
                │              (mixed $varUserSession, int $varRecordID)                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    setDataDelete (
                        mixed $varUserSession, int $varRecordID
                        )
                            {
                            //---> Data Initialization
                                $varReturn =
                                    (bool) null;

                            //---> Data Process
                                try {
                                    $varReturn =
                                        (new \App\Models\Database\PostgreSQL\SchSysConfig\General())->setDataDelete(
                                            $varUserSession,
                                            $varRecordID
                                            );
                                    }
                                catch (\Exception $ex) {
                                    }

                            //---> Data Return
                                return
                                    $varReturn;
                            }
                }
        }
