<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                           │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\General\System                                                                                │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2020 - 2025 Zheta (teguhpjs@gmail.com)                                                                                      │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Http\Helpers\ZhtHelper\General\System
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ Helper_API                                                                                                       │
        │ ▪ Description │ Menangani segala hal yang terkait API dari System                                                                │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            Helper_API
                {
                /*
                ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ Class Property Declaration                                                                                               │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __construct                                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2020-10-05                                                                                           │
                │ ▪ Creation Date   │ 2020-10-05                                                                                           │
                │ ▪ Description     │ System's Default Constructor                                                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __construct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __destruct                                                                                           │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2020-10-05                                                                                           │
                │ ▪ Creation Date   │ 2020-10-05                                                                                           │
                │ ▪ Description     │ System's Default Destructor                                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __destruct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getAPIWebToken_System                                                                                │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-23                                                                                           │
                │ ▪ Creation Date   │ 2025-12-23                                                                                           │
                │ ▪ Description     │ Mencari API Web Token of System                                                                      │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getAPIWebToken_System (
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Reinitializing : varReturn
                                        $varReturn = (
                                            \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::getQueryExecution (
                                                self::getUserSessionID_System(),
                                                'SELECT "SchSysConfig"."FuncSys_General_GetAPIWebToken_SysEngine"()'
                                                )
                                            )['data'][0]['FuncSys_General_GetAPIWebToken_SysEngine'];
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getUserSessionID_System                                                                              │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-08-11                                                                                           │
                │ ▪ Description     │ Mencari User Session ID of System                                                                    │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (int)                                                                                                   │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\System\Helper_Environment::                                                   │
                │           getConfigEnvironment                                                                                           │
                │              (mixed $varUserSession, string $varKey, string $varPostfix)                                                 │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getUserSessionID_System (
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (int) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    $varUserSession =
                                        0;

                                    //---> Reinitializing : varReturn
                                        $varReturn =
                                            \App\Http\Helpers\ZhtHelper\General\System\Helper_Environment::getConfigEnvironment (
                                                $varUserSession,
                                                'USER_SESSION_ID_SYSTEM',
                                                '.LaravelCore/config/Application/BackEnd/environment.txt'
                                                );
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getUserSessionIDByAPIWebToken                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-23                                                                                           │
                │ ▪ Creation Date   │ 2025-12-23                                                                                           │
                │ ▪ Description     │ Mendapatkan User Session ID Berdasarkan API Web Token                                                │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varAPIWebToken (string - Mandatory)                                                                               │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (int)                                                                                                   │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\System\Helper_Environment::                                                   │
                │           getConfigEnvironment                                                                                           │
                │              (mixed $varUserSession, string $varKey, string $varPostfix)                                                 │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getUserSessionIDByAPIWebToken (
                        string $varAPIWebToken
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (int) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Reinitializing : varReturn
                                        $varReturn = (
                                            \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::getQueryExecution (
                                                self::getUserSessionID_System(),
                                                '
                                                SELECT
                                                    COALESCE (
                                                        "Sys_PID",
                                                        "Sys_SID"
                                                        ) AS "Sys_ID"
                                                FROM
                                                    "SchSysConfig"."TblLog_UserLoginSession"
                                                WHERE
                                                    "APIWebToken" = \''.$varAPIWebToken.'\'::varchar
                                                    AND
                                                    "Sys_Data_Delete_DateTimeTZ" IS NULL
                                                    AND
                                                    "Sys_Data_Hidden_DateTimeTZ" IS NULL
                                                '
                                                )
                                            )['data'][0]['Sys_ID'];
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getAPIWebTokenByUserSessionID                                                                        │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2025-12-23                                                                                           │
                │ ▪ Creation Date   │ 2025-12-23                                                                                           │
                │ ▪ Description     │ Mendapatkan API Web Token Berdasarkan User Session ID                                                │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSessionID (int - Mandatory)                                                                                │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\System\Helper_Environment::                                                   │
                │           getConfigEnvironment                                                                                           │
                │              (mixed $varUserSession, string $varKey, string $varPostfix)                                                 │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getAPIWebTokenByUserSessionID (
                        int $varUserSessionID
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Reinitializing : varReturn
                                        $varReturn = (
                                            \App\Http\Helpers\ZhtHelper\BackEnd\Database\Helper_PostgreSQL::getQueryExecution (
                                                self::getUserSessionID_System(),
                                                '
                                                SELECT
                                                    "SchSysConfig"."FuncSys_General_GetUserLoginSession_APIWebToken" (
                                                        '.$varUserSessionID.'::bigint
                                                        )
                                                '
                                                )
                                            )['data'][0]['FuncSys_General_GetUserLoginSession_APIWebToken'];
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ setCallAPIGateway                                                                                    │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0002.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-23                                                                                           │
                │ ▪ Creation Date   │ 2020-10-05                                                                                           │
                │ ▪ Description     │ Memanggil API Gateway                                                                                │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varAPIWebToken (string - Mandatory) ► API WebToken                                                                │
                │      ▪ varAPIKey (string - Mandatory) ► API Key                                                                          │
                │      ------------------------------                                                                                      │
                │      ▪ varAPIVersion (mixed - Optional) ► API Version                                                                    │
                │      ▪ varData (array - Optional) ► Data                                                                                 │
                │      ▪ varSignDisplayErrorPage (bool - Optional) ► Sign Display Error Page                                               │
                │      ▪ varSignUseHTTPProxy (bool - Optional) ► Sign Use HTTP Proxy                                                       │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    setCallAPIGateway (
                        mixed $varUserSession, string $varAPIWebToken, string $varAPIKey, 
                        string $varAPIVersion = null, array $varData = null, bool $varSignDisplayErrorPage = null, bool $varSignUseHTTPSProxy = null
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                //---> Reinitializing : varAPIVersion
                                    if (!$varAPIVersion) {
                                        $varAPIVersion =
                                            'latest';
                                        }
                                    else {
                                        $varAPIVersion =
                                            strtolower (
                                                $varAPIVersion
                                                );
                                        }

                                //---> Reinitializing : varSignDisplayErrorPage
                                    if ($varSignDisplayErrorPage === null) {
                                        $varSignDisplayErrorPage = true;
                                        }

                                //---> Reinitializing : varSignUseHTTPSProxy
                                    if ($varSignUseHTTPSProxy === null) {
                                        $varSignUseHTTPSProxy = false;
                                        }

                                //---> Reinitializing : varData
                                    if (!$varData) {
                                        $varData = [];
                                        }

                                //---> Reinitializing : varURL
                                    $varURL = 
                                        str_replace(
                                            'http:',
                                            (\App\Http\Helpers\ZhtHelper\General\Utilities\Helper_Network::isHTTPS($varUserSession) == TRUE ? 'https:' : 'http:'),
                                            'http://172.28.0.30/api/gateway'
                                            //\App\Helpers\ZhtHelper\System\Helper_Environment::getFrontEndConfigEnvironment($varUserSession, 'URL_BACKEND_API_GATEWAY')
                                            );

                                //---> Initializing : varDataArray
                                    $varDataArray = [
                                        'header' => [
                                            'authorization' => 'Bearer'.' '.$varAPIWebToken,
                                            'URL' => $varURL
                                            ],
                                        'metadata' => [
                                            'API' => [
                                                'key' => $varAPIKey,
                                                'version' => $varAPIVersion
                                                ]
                                            ],
                                        'data' => $varData
                                        ];
                                    //dd($varDataArray);
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Initializing : varResponseData
                                        $varResponseData =
                                             \App\Http\Helpers\ZhtHelper\General\System\Helper_HTTPResponse::getResponse(
                                                $varUserSession,
                                                $varURL,
                                                $varDataArray
                                                );
                                    
                                        //dd($varAPIVersion);
                                        $varData = (
                                            new \DateTime()
                                            );



                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }
                }
        }