<?php

/*
┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ ▪ Category   : Laravel Helpers                                                                                                           │
│ ▪ Name Space : \App\Http\Helpers\ZhtHelper\General\System                                                                                │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ ▪ Copyleft 🄯 2020 - 2025 Zheta (teguhpjs@gmail.com)                                                                                      │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
*/

namespace
    App\Http\Helpers\ZhtHelper\General\System
        {
        /*
        ┌───────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
        │ ▪ Class Name  │ Helper_Environment                                                                                               │
        │ ▪ Description │ Menangani segala hal yang terkait Environment dari System                                                        │
        └───────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
        */
        class
            Helper_Environment
                {
                /*
                ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ Class Property Declaration                                                                                               │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __construct                                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2020-07-17                                                                                           │
                │ ▪ Creation Date   │ 2020-07-17                                                                                           │
                │ ▪ Description     │ System's Default Constructor                                                                         │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __construct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ __destruct                                                                                           │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000000                                                                                       │
                │ ▪ Last Update     │ 2020-07-17                                                                                           │
                │ ▪ Creation Date   │ 2020-07-17                                                                                           │
                │ ▪ Description     │ System's Default Destructor                                                                          │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public function
                    __destruct (
                        )
                            {
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getApplicationID                                                                                     │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-07-09                                                                                           │
                │ ▪ Description     │ Mendapatkan data Application ID                                                                      │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getApplicationID (
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Reinitializing : varReturn
                                        $varReturn =
                                            'ERPReborn';
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getApplicationDateTimeTZ                                                                             │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-07-09                                                                                           │
                │ ▪ Description     │ Mendapatkan data waktu saat ini                                                                      │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ (void)                                                                                                            │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪                                                                                                                   │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getApplicationDateTimeTZ (
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Set : Default Time Zone
                                        date_default_timezone_set (
                                            'Asia/Jakarta'
                                            );

                                    //---> Initializing : varDate
                                        $varDate =
                                            date_create (
                                                null,
                                                timezone_open (
                                                    'Asia/Jakarta'
                                                    )
                                                );

                                    //---> Initializing : varMicroDate
                                        $varMicroDate =
                                            microtime();

                                    //---> Initializing : varDateArray
                                        $varDateArray =
                                            explode (
                                                " ",
                                                $varMicroDate
                                                );

                                    //---> Initializing : varMicroSecond
                                        $varMicroSecond =
                                            substr (
                                                $varDateArray[1],
                                                0,
                                                6
                                                );

                                    //---> Initializing : varTimeZoneOffset
                                        $varTimeZoneOffset =
                                            str_pad (
                                                (($varDate->getOffset())/3600),
                                                2,
                                                '0',
                                                STR_PAD_LEFT
                                                );

                                    //---> Reinitializing : varReturn
                                        $varReturn = (
                                            date (
                                                "Y-m-d H:i:s.",
                                                time()
                                                ).
                                            $varMicroSecond.
                                            '+'.
                                            $varTimeZoneOffset
                                            );

                                        //$varUnixTime = (int) file_get_contents((stripos($_SERVER['SERVER_PROTOCOL'],'https') === 0 ? 'https://' : 'http://').'localhost/getJSUnixTime');
                                        //$varReturn = date("Y-m-d H:i:s.", $varUnixTime).$varMicroSecond.'+'.$varTimeZoneOffset;
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getBackEndConfigEnvironment                                                                          │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-08-05                                                                                           │
                │ ▪ Description     │ Mencari nilai Konfigurasi Environment Back End sesuai Kunci Parameter (varKey)                       │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varKey (string - Mandatory) ► Parameter                                                                           │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (mixed)                                                                                                 │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\System\Helper_Environment::                                                   │
                │           getBackEndConfigEnvironment                                                                                    │
                │              (mixed $varUserSession, string $varKey)                                                                     │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getBackEndConfigEnvironment (
                        mixed $varUserSession, string $varKey
                        )
                            {                            
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Reinitializing : varReturn
                                    $varReturn =
                                        self::getConfigEnvironment (
                                            $varUserSession,
                                            $varKey,
                                            '/config/Application/BackEnd/environment.txt'
                                            );

                                    if (is_numeric ($varReturn) == true)
                                        {
                                        $varReturn =
                                            ($varReturn * 1);
                                        }
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }


                /*
                ┌───────────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────┐
                │ ▪ Method Name     │ getConfigEnvironment                                                                                 │
                ├───────────────────┼──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Version         │ 1.0000.0000001                                                                                       │
                │ ▪ Last Update     │ 2025-12-16                                                                                           │
                │ ▪ Creation Date   │ 2020-08-05                                                                                           │
                │ ▪ Description     │ Mencari nilai Konfigurasi Environment pada file tertentu (varPostfix) sesuai Kunci Parameter         │
                │                   │ (varKey)                                                                                             │
                ├───────────────────┴──────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Input Variable  :                                                                                                      │
                │      ▪ varUserSession (mixed - Mandatory) ► User Session                                                                 │
                │      ▪ varKey (string - Mandatory) ► Parameter                                                                           │
                │      ▪ varPostfix (string - Mandatory) ► Path nama file                                                                  │
                │      ------------------------------                                                                                      │
                │ ▪ Output Variable :                                                                                                      │
                │      ▪ varReturn (string)                                                                                                │
                ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
                │ ▪ Linked Function :                                                                                                      │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_Array::                                                      │
                │           isKeyExist                                                                                                     │
                │              (mixed $varUserSession, string $varPath)                                                                    │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_File::                                                       │
                │           getAutoMatchFilePath                                                                                           │
                │              (mixed $varUserSession, string $varPrefix, string $varPostfix)                                              │
                │      ▪ \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_File::                                                       │
                │           getFileContent                                                                                                 │
                │              (mixed $varUserSession, string $varPath)                                                                    │
                └──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
                */
                public static function
                    getConfigEnvironment (
                        mixed $varUserSession, string $varKey, string $varPostfix
                        )
                            {
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------( START )-----
                                //---> Initializing : varReturn
                                    $varReturn =
                                        (string) null;
                            //-----[ DATA INITIALIZATION ]-------------------------------------------------------------------(  END  )-----

                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------( START )-----
                                try {
                                    //---> Initializing : varArrayTemp
                                        $varArrayTemp =
                                            explode (
                                                "\n",
                                                \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_File::getFileContent (
                                                    $varUserSession,
                                                    \App\Http\Helpers\ZhtHelper\General\Utilities\Helper_File::getAutoMatchFilePath (
                                                        $varUserSession,
                                                        (getcwd().'/'),
                                                        $varPostfix
                                                        )
                                                    )
                                                );

                                    //---> ...
                                        for ($i = 0; $i != count ($varArrayTemp); $i++)
                                            {
                                            if (strlen ($varArrayTemp[$i]) > 0)
                                                {
                                                $varArrayTemp2 =
                                                    explode(
                                                        "=",
                                                        $varArrayTemp[$i]
                                                        );

                                                $varValue =
                                                    $varArrayTemp2;

                                                array_shift (
                                                    $varValue
                                                    );

                                                $varValue =
                                                    implode (
                                                        "=",
                                                        $varValue
                                                        );

                                                $varData[$varArrayTemp2[0]] =
                                                    $varValue;
                                                }
                                            }

                                    //---> Reinitializing : varReturn
                                        if (\App\Http\Helpers\ZhtHelper\General\Utilities\Helper_Array::isKeyExist (
                                            $varUserSession,
                                            $varKey,
                                            $varData
                                            ) == true
                                            )
                                            { 
                                            $varReturn =
                                                $varData[$varKey];
                                            }
                                    }

                                catch (\Exception $ex) {
                                    }
                            //-----[ DATA PROCESS ]--------------------------------------------------------------------------(  END  )-----

                            //-----[ DATA RETURN ]---------------------------------------------------------------------------( START )-----
                                return
                                    $varReturn;
                            //-----[ DATA RETURN ]---------------------------------------------------------------------------(  END  )-----
                            }
                }
        }